library hospital_list;
class Hospitals {
  int id;
  String label;
  double lat;
  double lng;
  String phone;
  List<int> type;
  
  Hospitals(this.id, this.label, this.lat, this.lng, this.phone, this.type);
}

Hospitals h1 = Hospitals(1001,"โรงพยาบาลค่ายสมเด็จพระนเรศวรมหาราช",16.834065,100.254326,"055-245-070",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h2 = Hospitals(1002,"โรงพยาบาลจิตเวชพิษณุโลก",16.866437,100.670591,"055-002-050",[1,1,0,0,1,0,0,0,0,0]);
Hospitals h3 = Hospitals(1003,"โรงพยาบาลพุทธชินราช พิษณุโลก",16.808439,100.263569,"055-270-300",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h4 = Hospitals(1004,"โรงพยาบาลมหาวิทยาลัยนเรศวร",16.748813,100.188986,"055-965-666",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h5 = Hospitals(1005,"โรงพยาบาลสมเด็จพระยุพราชนครไทย จังหวัดพิษณุโลก",17.093205,100.829325,"055-389-060",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h6 = Hospitals(1006,"โรงพยาบาลชาติตระการ",17.273167,100.601523,"055-381-020",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h7 = Hospitals(1007,"โรงพยาบาลเนินมะปราง",16.562166,100.623603,"055-399-055",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h8 = Hospitals(1008,"โรงพยาบาลบางกระทุ่ม",16.575844,100.317901,"055-391-061",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h9 = Hospitals(1009,"โรงพยาบาลบางระกำ",16.759335,100.118859,"055-371-168",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h10 = Hospitals(1010,"โรงพยาบาลพรหมพิราม",17.034809,100.201195,"055-369-034",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h11 = Hospitals(1011,"โรงพยาบาลวังทอง",16.838792,100.435122,"055-311-017",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h12 = Hospitals(1012,"โรงพยาบาลวัดโบสถ์",16.988576,100.327104,"055-361-079",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h13 = Hospitals(1013,"โรงพยาบาลกรุงเทพพิษณุโลก",16.816633,100.27309,"1724",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h14 = Hospitals(1014,"โรงพยาบาลพิษณุโลก ฮอสพิทอล",16.805656,100.255194,"055-909-888",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h15 = Hospitals(1015,"โรงพยาบาลพิษณุเวช",16.808333,100.259815,"055-909-000",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h16 = Hospitals(10166,"โรงพยาบาลรวมแพทย์พิษณุโลก",16.809761,100.259569,"055-219-307",[1,1,0,0,0,0,0,0,0,0]);
Hospitals h17 = Hospitals(1017,"คลินิกพิชิตการแพทย์กระดูกและข้อ"   ,16.811106,100.264235,"055-242-815",[0,0,0,1,0,0,0,0,0,0]);
Hospitals h18 = Hospitals(1018,"คลินิกนายแพทย์ดนัย"   ,16.810943,100.260683,"055-225-133",[0,1,0,0,0,0,0,0,0,0]);
Hospitals h19 = Hospitals(1019,"คลินิกแพทย์โชคดี"   ,16.80997,100.261912,"015-323-044",[0,1,0,0,0,0,0,0,0,0]);
Hospitals h20 = Hospitals(1020,"คลินิกแพทย์วรรณา",16.804685,100.253953," ",[0,1,0,0,0,1,0,0,0,0]);
Hospitals h21 = Hospitals(1021,"คลินิกหู คอ จมูกแพทย์กาญจนา",16.812152,100.261443,"055-219-874",[0,0,0,0,0,0,1,0,0,0]);
Hospitals h22 = Hospitals(1022,"วิทยาจักษุคลินิก"  ,16.810336,100.261305,"081-887-1226",[0,0,1,0,0,0,0,0,0,0]);
Hospitals h23 = Hospitals(1023,"คลินิกชูศักดิ์-อัชพรการแพทย์",16.812624,100.262671," ",[0,1,0,0,0,0,0,0,0,0]);
Hospitals h24 = Hospitals(1024,'คลินิกนายแพทย์สุจิณ',16.810047,100.262248," ",[0,1,0,0,0,0,0,0,0,0]);
Hospitals h25 = Hospitals(1025,"คลินิกแพทย์อนิศรา",16.810789,100.267481,"055-247-691",[0,0,0,0,0,0,0,1,0,0]);
Hospitals h26 = Hospitals(1026,"ราชเทวีคลินิกเวชกรรม",16.826686,100.254977,"055-248-123",[0,1,0,0,0,0,0,0,0,0]);
Hospitals h27 = Hospitals(1027,"คลินิกกาญจนาทันตแพทย์",16.811123,100.265174,"055-219-503",[0,0,0,0,0,0,0,1,0,0]);
Hospitals h28 = Hospitals(1028,"คลินิกแพทย์นเรศ",16.813412,100.262987,"015-323-950",[0,0,0,0,0,0,0,0,1,0]);
Hospitals h29 = Hospitals(1029,"คลินิกเวชกรรมรักษ์หัวใจ" ,16.804762,100.262084,"083-488-5561",[0,1,0,1,0,0,0,0,0,1]);
Hospitals h30 = Hospitals(1030,"มาร์เวลลัสคลินิกเวชกรรม"  ,16.824328,100.256056,"081-532-0505",[0,1,0,0,0,0,0,0,0,0]);
